{
  "_name_or_path": "/home/wanghan/data/ft-data/competition_kit/data/models/falcon-rw-1b",
  "alibi": true,
  "apply_residual_connection_post_layernorm": false,
  "architectures": [
    "FalconForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_falcon.FalconConfig",
    "AutoModel": "modeling_falcon.FalconModel",
    "AutoModelForCausalLM": "modeling_falcon.FalconForCausalLM",
    "AutoModelForQuestionAnswering": "modeling_falcon.FalconForQuestionAnswering",
    "AutoModelForSequenceClassification": "modeling_falcon.FalconForSequenceClassification",
    "AutoModelForTokenClassification": "modeling_falcon.FalconForTokenClassification"
  },
  "bias": true,
  "bos_token_id": 50256,
  "eos_token_id": 50256,
  "hidden_dropout": 0.0,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "falcon",
  "multi_query": false,
  "new_decoder_architecture": false,
  "num_attention_heads": 32,
  "num_hidden_layers": 24,
  "num_kv_heads": 32,
  "pad_token_id": 50257,
  "parallel_attn": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.34.1",
  "unk_token_id": 50256,
  "use_cache": false,
  "vocab_size": 50258
}
